In [1]:
import pandas as pd 

file_path = "C:/Users/acer/OneDrive/Desktop/marketing_campaign.csv"

df = pd.read_csv(file_path, sep = '\t')

df

,ID,Year_Birth,Education,Marital_Status,Income,Kidhome,Teenhome,Dt_Customer,Recency,MntWines,...,NumWebVisitsMonth,AcceptedCmp3,AcceptedCmp4,AcceptedCmp5,AcceptedCmp1,AcceptedCmp2,Complain,Z_CostContact,Z_Revenue,Response
0,5524,1957,Graduation,Single,58138.0,0,0,04-09-2012,58,635,...,7,0,0,0,0,0,0,3,11,1
1,2174,1954,Graduation,Single,46344.0,1,1,08-03-2014,38,11,...,5,0,0,0,0,0,0,3,11,0
2,4141,1965,Graduation,Together,71613.0,0,0,21-08-2013,26,426,...,4,0,0,0,0,0,0,3,11,0
3,6182,1984,Graduation,Together,26646.0,1,0,10-02-2014,26,11,...,6,0,0,0,0,0,0,3,11,0
4,5324,1981,PhD,Married,58293.0,1,0,19-01-2014,94,173,...,5,0,0,0,0,0,0,3,11,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
2235,10870,1967,Graduation,Married,61223.0,0,1,13-06-2013,46,709,...,5,0,0,0,0,0,0,3,11,0
2236,4001,1946,PhD,Together,64014.0,2,1,10-06-2014,56,406,...,7,0,0,0,1,0,0,3,11,0
2237,7270,1981,Graduation,Divorced,56981.0,0,0,25-01-2014,91,908,...,6,0,1,0,0,0,0,3,11,0
2238,8235,1956,Master,Together,69245.0,0,1,24-01-2014,8,428,...,3,0,0,0,0,0,0,3,11,0
2239,9405,1954,PhD,Married,52869.0,1,1,15-10-2012,40,84,...,7,0,0,0,0,0,0,3,11,1

In [2]:
df.isnull().sum()

ID                      0
Year_Birth              0
Education               0
Marital_Status          0
Income                 24
Kidhome                 0
Teenhome                0
Dt_Customer             0
Recency                 0
MntWines                0
MntFruits               0
MntMeatProducts         0
MntFishProducts         0
MntSweetProducts        0
MntGoldProds            0
NumDealsPurchases       0
NumWebPurchases         0
NumCatalogPurchases     0
NumStorePurchases       0
NumWebVisitsMonth       0
AcceptedCmp3            0
AcceptedCmp4            0
AcceptedCmp5            0
AcceptedCmp1            0
AcceptedCmp2            0
Complain                0
Z_CostContact           0
Z_Revenue               0
Response                0
dtype: int64

In [3]:
df.fillna(method = 'ffill' , inplace = True)

df.isnull().sum()

C:\Users\acer\AppData\Local\Temp\ipykernel_10268\1187507290.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method = 'ffill' , inplace = True)

ID                     0
Year_Birth             0
Education              0
Marital_Status         0
Income                 0
Kidhome                0
Teenhome               0
Dt_Customer            0
Recency                0
MntWines               0
MntFruits              0
MntMeatProducts        0
MntFishProducts        0
MntSweetProducts       0
MntGoldProds           0
NumDealsPurchases      0
NumWebPurchases        0
NumCatalogPurchases    0
NumStorePurchases      0
NumWebVisitsMonth      0
AcceptedCmp3           0
AcceptedCmp4           0
AcceptedCmp5           0
AcceptedCmp1           0
AcceptedCmp2           0
Complain               0
Z_CostContact          0
Z_Revenue              0
Response               0
dtype: int64

In [4]:
df.duplicated().sum()

np.int64(0)

In [5]:
df.describe()

,ID,Year_Birth,Income,Kidhome,Teenhome,Recency,MntWines,MntFruits,MntMeatProducts,MntFishProducts,...,NumWebVisitsMonth,AcceptedCmp3,AcceptedCmp4,AcceptedCmp5,AcceptedCmp1,AcceptedCmp2,Complain,Z_CostContact,Z_Revenue,Response
count,2240.000000,2240.000000,2240.000000,2240.000000,2240.000000,2240.000000,2240.000000,2240.000000,2240.000000,2240.000000,...,2240.000000,2240.000000,2240.000000,2240.000000,2240.000000,2240.000000,2240.000000,2240.0,2240.0,2240.000000
mean,5592.159821,1968.805804,52185.749107,0.444196,0.506250,49.109375,303.935714,26.302232,166.950000,37.525446,...,5.316518,0.072768,0.074554,0.072768,0.064286,0.013393,0.009375,3.0,11.0,0.149107
std,3246.662198,11.984069,25130.381652,0.538398,0.544538,28.962453,336.597393,39.773434,225.715373,54.628979,...,2.426645,0.259813,0.262728,0.259813,0.245316,0.114976,0.096391,0.0,0.0,0.356274
min,0.000000,1893.000000,1730.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,...,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,3.0,11.0,0.000000
25%,2828.250000,1959.000000,35196.000000,0.000000,0.000000,24.000000,23.750000,1.000000,16.000000,3.000000,...,3.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,3.0,11.0,0.000000
50%,5458.500000,1970.000000,51411.500000,0.000000,0.000000,49.000000,173.500000,8.000000,67.000000,12.000000,...,6.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,3.0,11.0,0.000000
75%,8427.750000,1977.000000,68413.250000,1.000000,1.000000,74.000000,504.250000,33.000000,232.000000,50.000000,...,7.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,3.0,11.0,0.000000
max,11191.000000,1996.000000,666666.000000,2.000000,2.000000,99.000000,1493.000000,199.000000,1725.000000,259.000000,...,20.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,3.0,11.0,1.000000

In [6]:
df.rename(columns={
    'kidhome': 'kid_home',
    'Teenhome': 'Teen_home',
    'Dt_Customer': 'Date',
    'MntWines': 'Mnt_Wines',
    'MntFruits': 'Mnt_Fruits',
    'MntMeatProducts': 'Mnt_Meat_Products',
    'MntFishProducts': 'Mnt_Fish_Products',  # removed extra space before Mnt
    'MntGoldProds': 'Gold_Products',
    'NumDealPurchases': 'Deal_Purchases',
    'NumWebPurchases': 'Web_Purchases',
    'NumCatalogPurchases': 'Catalog_Purchases',
    'NumStorePurchases': 'Store_Purchases',
    'NumWebVisitsMonth': 'Web_Visit_Month',
    'AcceptedCmp3': 'Cmp3',
    'AcceptedCmp4': 'Cmp4',
    'AcceptedCmp1': 'Cmp1',
    'AcceptedCmp2': 'Cmp2',
    'AcceptedCmp5' : 'Cmp5'
}, inplace=True)


df.columns

Index(['ID', 'Year_Birth', 'Education', 'Marital_Status', 'Income', 'Kidhome',
       'Teen_home', 'Date', 'Recency', 'Mnt_Wines', 'Mnt_Fruits',
       'Mnt_Meat_Products', 'Mnt_Fish_Products', 'MntSweetProducts',
       'Gold_Products', 'NumDealsPurchases', 'Web_Purchases',
       'Catalog_Purchases', 'Store_Purchases', 'Web_Visit_Month', 'Cmp3',
       'Cmp4', 'Cmp5', 'Cmp1', 'Cmp2', 'Complain', 'Z_CostContact',
       'Z_Revenue', 'Response'],
      dtype='object')

In [7]:
df.dtypes

ID                     int64
Year_Birth             int64
Education             object
Marital_Status        object
Income               float64
Kidhome                int64
Teen_home              int64
Date                  object
Recency                int64
Mnt_Wines              int64
Mnt_Fruits             int64
Mnt_Meat_Products      int64
Mnt_Fish_Products      int64
MntSweetProducts       int64
Gold_Products          int64
NumDealsPurchases      int64
Web_Purchases          int64
Catalog_Purchases      int64
Store_Purchases        int64
Web_Visit_Month        int64
Cmp3                   int64
Cmp4                   int64
Cmp5                   int64
Cmp1                   int64
Cmp2                   int64
Complain               int64
Z_CostContact          int64
Z_Revenue              int64
Response               int64
dtype: object

In [8]:
df['Date'] = pd.to_datetime(df['Date'], errors='coerce')

df['Education'] = df['Education'].astype('category')
df['Marital_Status'] = df['Marital_Status'].astype('category')


binary_cols = ['Cmp3', 'Cmp4', 'Cmp5', 'Cmp1', 'Cmp2', 'Complain', 'Response']

df[binary_cols] = df[binary_cols].astype(bool)

df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2240 entries, 0 to 2239
Data columns (total 29 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   ID                 2240 non-null   int64
 1   Year_Birth         2240 non-null   int64
 2   Education          2240 non-null   category
 3   Marital_Status     2240 non-null   category
 4   Income             2240 non-null   float64
 5   Kidhome            2240 non-null   int64
 6   Teen_home          2240 non-null   int64
 7   Date               916 non-null    datetime64[ns]
 8   Recency            2240 non-null   int64
 9   Mnt_Wines          2240 non-null   int64
 10  Mnt_Fruits         2240 non-null   int64
 11  Mnt_Meat_Products  2240 non-null   int64
 12  Mnt_Fish_Products  2240 non-null   int64
 13  MntSweetProducts   2240 non-null   int64
 14  Gold_Products      2240 non-null   int64
 15  NumDealsPurchases  2240 non-null   int64
 16  Web_Purchases      2240 non-null   int64
 17  Catalog_Purchases  2240 non-null   int64
 18  Store_Purchases    2240 non-null   int64
 19  Web_Visit_Month    2240 non-null   int64
 20  Cmp3               2240 non-null   bool
 21  Cmp4               2240 non-null   bool
 22  Cmp5               2240 non-null   bool
 23  Cmp1               2240 non-null   bool
 24  Cmp2               2240 non-null   bool
 25  Complain           2240 non-null   bool
 26  Z_CostContact      2240 non-null   int64
 27  Z_Revenue          2240 non-null   int64
 28  Response           2240 non-null   bool
dtypes: bool(7), category(2), datetime64[ns](1), float64(1), int64(18)
memory usage: 370.4 KB

In [9]:
df.drop_duplicates()

,ID,Year_Birth,Education,Marital_Status,Income,Kidhome,Teen_home,Date,Recency,Mnt_Wines,...,Web_Visit_Month,Cmp3,Cmp4,Cmp5,Cmp1,Cmp2,Complain,Z_CostContact,Z_Revenue,Response
0,5524,1957,Graduation,Single,58138.0,0,0,2012-04-09,58,635,...,7,False,False,False,False,False,False,3,11,True
1,2174,1954,Graduation,Single,46344.0,1,1,2014-08-03,38,11,...,5,False,False,False,False,False,False,3,11,False
2,4141,1965,Graduation,Together,71613.0,0,0,NaT,26,426,...,4,False,False,False,False,False,False,3,11,False
3,6182,1984,Graduation,Together,26646.0,1,0,2014-10-02,26,11,...,6,False,False,False,False,False,False,3,11,False
4,5324,1981,PhD,Married,58293.0,1,0,NaT,94,173,...,5,False,False,False,False,False,False,3,11,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
2235,10870,1967,Graduation,Married,61223.0,0,1,NaT,46,709,...,5,False,False,False,False,False,False,3,11,False
2236,4001,1946,PhD,Together,64014.0,2,1,2014-10-06,56,406,...,7,False,False,False,True,False,False,3,11,False
2237,7270,1981,Graduation,Divorced,56981.0,0,0,NaT,91,908,...,6,False,True,False,False,False,False,3,11,False
2238,8235,1956,Master,Together,69245.0,0,1,NaT,8,428,...,3,False,False,False,False,False,False,3,11,False
2239,9405,1954,PhD,Married,52869.0,1,1,NaT,40,84,...,7,False,False,False,False,False,False,3,11,True

In [10]:
df.isnull().sum()

ID                      0
Year_Birth              0
Education               0
Marital_Status          0
Income                  0
Kidhome                 0
Teen_home               0
Date                 1324
Recency                 0
Mnt_Wines               0
Mnt_Fruits              0
Mnt_Meat_Products       0
Mnt_Fish_Products       0
MntSweetProducts        0
Gold_Products           0
NumDealsPurchases       0
Web_Purchases           0
Catalog_Purchases       0
Store_Purchases         0
Web_Visit_Month         0
Cmp3                    0
Cmp4                    0
Cmp5                    0
Cmp1                    0
Cmp2                    0
Complain                0
Z_CostContact           0
Z_Revenue               0
Response                0
dtype: int64

In [11]:
df['Date'] = pd.to_datetime(df['Date'], format='%d-%m-%Y', errors='coerce')
df['Date'] = df['Date'].fillna(df['Date'].min())

df

,ID,Year_Birth,Education,Marital_Status,Income,Kidhome,Teen_home,Date,Recency,Mnt_Wines,...,Web_Visit_Month,Cmp3,Cmp4,Cmp5,Cmp1,Cmp2,Complain,Z_CostContact,Z_Revenue,Response
0,5524,1957,Graduation,Single,58138.0,0,0,2012-04-09,58,635,...,7,False,False,False,False,False,False,3,11,True
1,2174,1954,Graduation,Single,46344.0,1,1,2014-08-03,38,11,...,5,False,False,False,False,False,False,3,11,False
2,4141,1965,Graduation,Together,71613.0,0,0,2012-01-08,26,426,...,4,False,False,False,False,False,False,3,11,False
3,6182,1984,Graduation,Together,26646.0,1,0,2014-10-02,26,11,...,6,False,False,False,False,False,False,3,11,False
4,5324,1981,PhD,Married,58293.0,1,0,2012-01-08,94,173,...,5,False,False,False,False,False,False,3,11,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
2235,10870,1967,Graduation,Married,61223.0,0,1,2012-01-08,46,709,...,5,False,False,False,False,False,False,3,11,False
2236,4001,1946,PhD,Together,64014.0,2,1,2014-10-06,56,406,...,7,False,False,False,True,False,False,3,11,False
2237,7270,1981,Graduation,Divorced,56981.0,0,0,2012-01-08,91,908,...,6,False,True,False,False,False,False,3,11,False
2238,8235,1956,Master,Together,69245.0,0,1,2012-01-08,8,428,...,3,False,False,False,False,False,False,3,11,False
2239,9405,1954,PhD,Married,52869.0,1,1,2012-01-08,40,84,...,7,False,False,False,False,False,False,3,11,True

In [12]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2240 entries, 0 to 2239
Data columns (total 29 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   ID                 2240 non-null   int64
 1   Year_Birth         2240 non-null   int64
 2   Education          2240 non-null   category
 3   Marital_Status     2240 non-null   category
 4   Income             2240 non-null   float64
 5   Kidhome            2240 non-null   int64
 6   Teen_home          2240 non-null   int64
 7   Date               2240 non-null   datetime64[ns]
 8   Recency            2240 non-null   int64
 9   Mnt_Wines          2240 non-null   int64
 10  Mnt_Fruits         2240 non-null   int64
 11  Mnt_Meat_Products  2240 non-null   int64
 12  Mnt_Fish_Products  2240 non-null   int64
 13  MntSweetProducts   2240 non-null   int64
 14  Gold_Products      2240 non-null   int64
 15  NumDealsPurchases  2240 non-null   int64
 16  Web_Purchases      2240 non-null   int64
 17  Catalog_Purchases  2240 non-null   int64
 18  Store_Purchases    2240 non-null   int64
 19  Web_Visit_Month    2240 non-null   int64
 20  Cmp3               2240 non-null   bool
 21  Cmp4               2240 non-null   bool
 22  Cmp5               2240 non-null   bool
 23  Cmp1               2240 non-null   bool
 24  Cmp2               2240 non-null   bool
 25  Complain           2240 non-null   bool
 26  Z_CostContact      2240 non-null   int64
 27  Z_Revenue          2240 non-null   int64
 28  Response           2240 non-null   bool
dtypes: bool(7), category(2), datetime64[ns](1), float64(1), int64(18)
memory usage: 370.4 KB

In [13]:
df.isna().sum()

ID                   0
Year_Birth           0
Education            0
Marital_Status       0
Income               0
Kidhome              0
Teen_home            0
Date                 0
Recency              0
Mnt_Wines            0
Mnt_Fruits           0
Mnt_Meat_Products    0
Mnt_Fish_Products    0
MntSweetProducts     0
Gold_Products        0
NumDealsPurchases    0
Web_Purchases        0
Catalog_Purchases    0
Store_Purchases      0
Web_Visit_Month      0
Cmp3                 0
Cmp4                 0
Cmp5                 0
Cmp1                 0
Cmp2                 0
Complain             0
Z_CostContact        0
Z_Revenue            0
Response             0
dtype: int64

In [17]:
df.to_csv('customer personality.csv', index = False)
print("Your data is saved successfully")

Your data is saved successfully